Revit 2024 API
ParameterTypeId.NumberSystemDisplayRule Property
 "Display Rule"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId NumberSystemDisplayRule { get; }
Visual Basic
Public Shared ReadOnly Property NumberSystemDisplayRule As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ NumberSystemDisplayRule {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace